---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendingDetailType.SegmentLengthsDisplayOption
source: html/f11d4b73-7ee6-266f-09d4-e4122354ab58.htm
---
# Autodesk.Revit.DB.Structure.RebarBendingDetailType.SegmentLengthsDisplayOption Property

Identifies if the segment lengths are represented using dimensions or just as text.

## Syntax (C#)
```csharp
public BendingDetailSegmentLengthsDisplayOptions SegmentLengthsDisplayOption { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration